{
  "über_mich": "Über Mich",
  "skills": "Skills",
  "contact": "kontakt",
  "competence": "Meine Kernkompetenzen",
  "programming": "Programmierung",
  "programming-text": "Ich beherrsche verschiedene Programmiersprachen und kann vielseitige Anwendungen entwickeln. Diese Fähigkeiten machen mich flexibel und in verschiedenen Bereichen einsetzbar. Ob es sich um Webentwicklung, Softwareentwicklung oder die Lösung komplexer Probleme handelt, ich bin in der Lage, qualitativ hochwertige und effiziente Lösungen zu liefern.",
  "responsive": "Responsive Design",
  "responsive-text": "Dank meiner Kenntnisse im Responsive Design kann ich sicherstellen, dass Websites und Anwendungen auf allen Geräten optimal angezeigt werden. Egal ob auf einem Desktop, Tablet oder Smartphone, ich sorge dafür, dass die Benutzererfahrung konsistent und ansprechend bleibt. Durch die Anwendung moderner Techniken und Best Practices im Bereich des Responsive Web Designs passe ich Layouts und Inhalte dynamisch an.",
  "quality": "Qualitätssicherung",
  "quality-text": "Qualität und Zuverlässigkeit stehen bei meiner Arbeit im Vordergrund. Ich lege großen Wert auf gründliches Testen und Debugging, um sicherzustellen, dass die von mir entwickelten Anwendungen fehlerfrei und stabil sind. Durch den Einsatz automatisierter Testverfahren und sorgfältige Code-Überprüfung stelle ich sicher, dass jede Lösung den höchsten Standards entspricht.",
  "who_i_am": "WER BIN ICH",
  "story": "Meine Geschichte",
  "story1": "Geboren in Italien, genauer gesagt in Apulien, habe ich schon als Kind eine große Affinität zur Technologie in all ihren Formen gezeigt. Aufgrund persönlicher Umstände habe ich meine Studien nach dem Abitur nicht fortgesetzt. Aus diesem Grund habe ich mich 2014 entschieden, nach Deutschland zu ziehen. Seitdem habe ich in verschiedenen Branchen gearbeitet und vor etwa drei Jahren habe ich durch eine App meine Interesse für das Programmieren wiederentdeckt. Seitdem erweitere ich täglich meine Kenntnisse im Bereich Programmierung, lerne verschiedene Programmiersprachen und arbeite an meinen ersten Projekten.",
  "story2": "Während meiner beruflichen Laufbahn in Deutschland habe ich wertvolle Erfahrungen in unterschiedlichen Bereichen gesammelt, die meine technischen Fähigkeiten und mein Problemlösungsvermögen gestärkt haben. Ich habe sowohl in Teamumgebungen als auch selbstständig gearbeitet und dabei stets großen Wert auf Qualität und Effizienz gelegt. Mein Ziel ist es, weiterhin in der Welt der Programmierung zu wachsen und mich kontinuierlich weiterzubilden. Ich strebe danach, in einem kreativen und herausfordernden Umfeld zu arbeiten, wo ich meine Fähigkeiten einbringen und weiterentwickeln kann.",
  "werte": "Werte, die mich leiten",
  "respect": "RESPEKT",
  "respect-text": "Ich behandle alle Kollegen und Kunden mit Höflichkeit und Wertschätzung, was eine positive und produktive Arbeitsumgebung schafft.",
  "passion": "LEIDENSCHAFT",
  "passion-text": "Meine Begeisterung für Technologie und Programmierung treibt mich an, kontinuierlich zu lernen und mich zu verbessern.",
  "professionality": "PROFESSIONALITÄT",
  "professionality-text": "Ich lege großen Wert auf Pünktlichkeit, Zuverlässigkeit und Qualität in all meinen Projekten.",
  "patience": "AUSDAUER",
  "patience-text": "Herausforderungen und Rückschläge halten mich nicht auf. Ich bleibe fokussiert und arbeite hart, bis ich mein Ziel erreiche.",
  "creativity": "KREATIVITÄT",
  "creativity-text": "Ich finde innovative Lösungen und bringe frische Ideen in jedes Projekt ein, um einzigartige und effektive Ergebnisse zu erzielen.",
  "empathy": "EMPATHIE",
  "empathy-text": "Ich höre aktiv zu und verstehe die Bedürfnisse meiner Kollegen und Kunden, um gemeinsam die besten Ergebnisse zu erzielen.",
  "i_am": "Ich bin",
  "available_for": "offen für",
  "job": "Festanstellung",
  "project": "Projekte",
  "professional_growth": "Weiterbildung",
  "text1": "Ich bin auf der Suche nach neuen und spannenden Möglichkeiten. Eine davon ist eine Festanstellung. Mit mir an Bord können Sie auf einen seriösen, loyalen Mitarbeiter zählen, der stets offen für neue Herausforderungen und Diskussionen ist. Das macht mich zum perfekten Kandidaten für Ihr Unternehmen.",
  "text2": "Hast du ein Projekt und benötigst Unterstützung? Möchtest du eine Website für dein Unternehmen erstellen? Suchst du jemanden Zuverlässigen für dein Team? Dann bin ich die richtige Person fürdich. Dank meiner Kreativität und Fähigkeiten kann ich Professionalität und Originalität bieten.",
  "text3": "Ich strebe immer danach, mich zu verbessern und neue Dinge zu lernen! Ich bin stets offen für den Dialog und nehme konstruktive Kritik problemlos an. Im Leben hört man nie auf zu lernen, und gerade das motiviert mich, kontinuierlich an meinen Fähigkeiten zu arbeiten und neue Herausforderungen anzunehmen.",
  "to_contact": "Zum Kontakt >>",
  "technical_skills": "Meine Hart Skills",
  "skills_description": "Ich habe mir meine technischen Fähigkeiten durch Selbststudium und praktische Erfahrung angeeignet. Durch ständige Weiterbildung und die Arbeit an persönlichen Projekten habe ich ein solides Verständnis für verschiedene Programmiersprachen und Technologien entwickelt. Mein Fokus liegt darauf, kontinuierlich zu lernen und innovative Lösungen zu entwickeln. Ich bringe meine Kreativität und technisches Know-how ein, um qualitativ hochwertige Ergebnisse zu erzielen.",
  "html": "Ich verfüge über solide Kenntnisse in HTML, CSS und JavaScript, was es mir ermöglicht, ansprechende und interaktive Webseiten zu erstellen. Mit HTML strukturiere ich den Inhalt meiner Seiten, während CSS für das Styling und das Layout verantwortlich ist. JavaScript nutze ich, um die Benutzererfahrung zu verbessern und dynamische Elemente hinzuzufügen.",
  "angular": "Mit Angular entwickle ich leistungsstarke, responsive Websites. Meine Kompetenzen umfassen die Nutzung von TypeScript, Angular-Komponenten, und -Services für effiziente Single-Page-Anwendungen. Damit garantiere ich nicht nur Typensicherheit, sondern auch die schnelle Entwicklung und kreative Lösungen für komplexe Herausforderungen. Mit Angular Material bin ich in der Lage, moderne und intuitive Webkomponenten zu entwerfen und umzusetzen.",
  "python": "Zusätzlich zu meinen Webentwicklungskompetenzen arbeite ich auch mit Python. Obwohl ich mich noch im Lernprozess befinde, entwickle ich bereits grundlegende Fähigkeiten. Die Vielseitigkeit dieser Sprache ermöglicht es mir, mich in verschiedenen Bereichen der Softwareentwicklung weiterzuentwickeln.",
  "java": "Ich befinde mich noch im Lernprozess von Java, mache aber bereits meine ersten Schritte. Obwohl ich noch Anfänger bin, habe ich angefangen, einfache Programme zu entwickeln und mich mit den Grundlagen der Sprache vertraut zu machen. Mein Ziel ist es, meine Fähigkeiten in Java kontinuierlich auszubauen und komplexere Anwendungen zu erstellen.",
  "node_js": "Mit Grundkenntnissen im Backend, insbesondere in Node.js verfüge ich über die Fähigkeit, serverseitige Anwendungen zu entwickeln und zu verwalten. Meine Kenntnisse ermöglichen es mir, grundlegende Funktionen wie das Erstellen von Servern, das Verarbeiten von Anfragen und das Interagieren mit Datenbanken in Node.js zu implementieren. Während ich weiterhin lerne und mich entwickle, bin ich bereit, meine Fähigkeiten im Backend weiter auszubauen und komplexere Projekte zu übernehmen.",
  "github": "Durch meine fundierten Kenntnisse in der Nutzung von GitHub demonstriere ich eine effektive Versionierung und Zusammenarbeit in Projekten. Mit Branching, Pull Requests und Issue Tracking bin ich in der Lage, einen strukturierten und effizienten Entwicklungsprozess zu gewährleisten. Meine GitHub-Repositories spiegeln meine Fähigkeit wider, qualitativ hochwertigen Code zu produzieren und erfolgreich im Teamumfeld zu arbeiten.",
  "soft_skills": "Meine Soft Skills",
  "communication": "Kommunikationsfähigkeit",
  "Customer": "Kundenorientierung",
  "organisation": "Organisationstalent",
  "flexibility": "Flexibilität",
  "sales": "Verkaufstalent",
  "teamwork": "Teamfähigkeit",
  "problem-solving": "Problemlösungsfähigkeit",
  "contact-txt": "Wenn du bereit bist, deine Ideen in die Tat umzusetzen oder Fragen hast, freue ich mich auf deine Nachricht. Kontaktiere mich über das Formular unten, und lass uns gemeinsam großartige Dinge verwirklichen.",
  "surname": "Name*",
  "name": "Vorname*",
  "company": "Firma (Optional)",
  "phone": "Telefon (Optional)",
  "message": "Nachricht*",
  "sent": "Senden"
}
