{
  "über_mich": "About Me",
  "skills": "skills",
  "contact": "contact",
  "competence": "My core competencies",
  "programming": "Programming",
  "programming-text": "I am proficient in various programming languages and can develop versatile applications. These skills make me flexible and applicable in different areas. Whether it's web development, software development, or solving complex problems, I am capable of delivering high-quality and efficient solutions.",
  "responsive": "Responsive Design",
  "responsive-text": "Thanks to my knowledge in Responsive Design, I can ensure that websites and applications are displayed optimally on all devices. Whether on a desktop, tablet, or smartphone, I make sure that the user experience remains consistent and engaging. By applying modern techniques and best practices in the field of Responsive Web Design, I dynamically adjust layouts and content.",
  "quality": "Quality Assurance",
  "quality-text": "Quality and reliability are at the forefront of my work. I place great emphasis on thorough testing and debugging to ensure that the applications I develop are error-free and stable. By employing automated testing methods and careful code review, I ensure that every solution meets the highest standards.",
  "who_i_am": "WHO I AM",
  "story": "My Background",
  "story1": "Born in Italy, specifically in Apulia, I have shown a strong affinity for technology in all its forms since childhood. Due to personal circumstances, I did not continue my studies after high school. For this reason, in 2014 I decided to move to Germany. Since then, I have worked in various industries and about three years ago, I rediscovered my interest in programming through an app. Since then, I have been expanding my knowledge in programming daily, learning different programming languages, and working on my first projects.",
  "story2": "During my professional career in Germany, I have gained valuable experience in various fields that have strengthened my technical skills and problem-solving abilities. I have worked both in team environments and independently, always placing a strong emphasis on quality and efficiency. My goal is to continue growing in the world of programming and to continually advance my skills. I strive to work in a creative and challenging environment where I can apply and further develop my abilities.",
  "respect": "RESPECT",
  "respect-text": "I consistently show respect and kindness to colleagues and clients, contributing to a positive and productive work atmosphere.",
  "werte": "Personal guidelines",
  "passion": "PASSION",
  "passion-text": "My enthusiasm for technology and programming drives me to continuously learn and improve.",
  "professionality": "PROFESSIONALITY",
  "professionality-text": "I place great importance on punctuality, reliability, and quality in all my projects.",
  "patience": "ENDURANCE",
  "patience-text": "Challenges and setbacks don't stop me. I stay focused and work hard until I reach my goal.",
  "creativity": "CREATIVTY",
  "creativity-text": "I find innovative solutions and bring fresh ideas to every project to achieve unique and effective results.",
  "empathy": "EMPATHY",
  "empathy-text": "I actively listen and understand the needs of my colleagues and clients to achieve the best results together.",
  "i_am": "I am",
  "available_for": "available for:",
  "job": "Job",
  "project": "Projects",
  "professional_growth": "Growth",
  "text1": "I am looking for new and exciting opportunities. One of these is a permanent position. With me on board, you can count on a serious and loyal employee, always open to new challenges and discussions. This makes me the perfect candidate for your company.",
  "text2": "Do you have a project and need support? Would you like to create a website for your company? Are you looking for someone reliable for your team? Then I am the right person for you. Thanks to my creativity and skills, I can offer professionalism and originality.",
  "text3": "I always strive to improve myself and learn new things! I am always open to dialogue and easily accept constructive criticism. In life, you never stop learning, and that's what motivates me to continuously work on my skills and take on new challenges.",
  "to_contact": "Contact Me >>",
  "technical_skills": "Technical Skills",
  "skills_description": "I have acquired my technical skills through self-study and practical experience. Through continuous learning and working on personal projects, I have developed a solid understanding of various programming languages and technologies. My focus is on continuously learning and developing innovative solutions. I bring my creativity and technical know-how to achieve high-quality results.",
  "html": "I have solid knowledge of HTML, CSS, and JavaScript, which enables me to create engaging and interactive websites. I use HTML to structure the content of my pages, while CSS is responsible for styling and layout. I utilize JavaScript to enhance the user experience and add dynamic elements.",
  "angular": "With Angular, I develop powerful and responsive websites. My skills include using TypeScript, Angular components, and services for efficient single-page applications. This ensures not only type safety but also rapid development and creative solutions for complex challenges. With Angular Material, I am able to design and implement modern and intuitive web components.",
  "python": "In addition to my web development skills, I also work with Python. Although I am still in the learning process, I am already developing basic skills. The versatility of this language allows me to grow in various areas of software development.",
  "java": "I am still in the learning process of Java, but I am already taking my first steps. Although I am still a beginner, I have started developing simple programs and familiarizing myself with the basics of the language. My goal is to continuously expand my skills in Java and create more complex applications.",
  "node_js": "With basic knowledge in backend development, particularly in Node.js, I have the ability to develop and manage server-side applications. My skills enable me to implement fundamental functions such as creating servers, processing requests, and interacting with databases in Node.js. As I continue to learn and grow, I am ready to further expand my backend skills and take on more complex projects.",
  "github": "Through my solid knowledge of using GitHub, I demonstrate effective version control and collaboration in projects. With branching, pull requests, and issue tracking, I am able to ensure a structured and efficient development process. My GitHub repositories reflect my ability to produce high-quality code and successfully work in a team environment.",
  "soft_skills": "Soft Skills",
  "communication": "Communication",
  "Customer": "Customer Focus",
  "organisation": "Organisation",
  "flexibility": "Versatility",
  "sales": "Sales Capability",
  "teamwork": "Teamwork",
  "problem-solving": "Problem-Solving",
  "contact-txt": "If you're ready to turn your ideas into action or have any questions, I look forward to hearing from you. Contact me using the form below, and let's create something great together.",
  "surname": "Last Name*",
  "name": "Name*",
  "company": "Company (Optional)",
  "phone": "Telephone (Optional)",
  "message": "Message*",
  "sent": "Sent"
}
