{
  "über_mich": "Chi Sono",
  "skills": "Skills",
  "contact": "Contattami",
  "competence": "Competenze Principali",
  "programming": "Programmazione",
  "programming-text": "Con una solida conoscenza di diversi linguaggi di programmazione, sono in grado di sviluppare applicazioni versatili e di alta qualità. Questa competenza mi consente di adattarmi facilmente a vari ambiti, che si tratti di sviluppo web, software, o risoluzione di problemi complessi. Grazie alla mia flessibilità e alla mia capacità di fornire soluzioni efficienti e innovative, sono in grado di affrontare e risolvere le sfide tecniche con approcci creativi e ben strutturati.",
  "responsive": "Design Responsivo",
  "responsive-text": "Grazie alle mie competenze nel Responsive Design, posso garantire che siti web e applicazioni siano ottimizzati per tutti i dispositivi. Che si tratti di desktop, tablet o smartphone, mi assicuro che l'esperienza utente rimanga coerente e coinvolgente. Utilizzando tecniche moderne e best practices nel Responsive Web Design, adatto dinamicamente layout e contenuti per garantire un'ottimale visualizzazione e interazione.",
  "quality": "Qualitá del codice",
  "quality-text": "La qualità e l'affidabilità sono al centro del mio lavoro. Mi dedico con attenzione a test approfonditi e al debugging per garantire che le applicazioni sviluppate siano prive di errori e altamente stabili. Adotto metodi di test automatizzati e una scrupolosa revisione del codice per assicurare che ogni soluzione rispetti i più alti standard di eccellenza e performance.",
  "who_i_am": "CHI SONO",
  "story": "Il mio Background",
  "story1": "Nato in Italia, precisamente in Puglia, fin da bambino ho mostrato una grande affinità per la tecnologia in tutte le sue forme. A causa di circostanze personali, non ho proseguito gli studi dopo il diploma e per questo motivo, nel 2014 ho deciso di trasferirmi in Germania. Da allora, ho lavorato in vari settori e circa tre anni fa ho riscoperto il mio interesse per la programmazione attraverso un'app. Da quel momento, ogni giorno amplifico le mie conoscenze nel campo della programmazione, imparo diversi linguaggi di programmazione e lavoro ai miei primi progetti.",
  "story2": "Durante la mia carriera professionale in Germania, ho acquisito preziose esperienze in diversi settori che hanno rafforzato le mie competenze tecniche e la mia capacità di risolvere problemi. Ho lavorato sia in team che in autonomia, ponendo sempre grande attenzione alla qualità e all'efficienza. Il mio obiettivo è continuare a crescere nel mondo della programmazione e a formarmi continuamente. Ambisco a lavorare in un ambiente creativo e stimolante, dove posso mettere in pratica e sviluppare ulteriormente le mie competenze.",
  "werte": "Principi guida",
  "respect": "RISPETTO",
  "respect-text": "Sono sempre cortese e rispettoso con i miei colleghi e clienti, il che favorisce un ambiente di lavoro positivo e produttivo.",
  "passion": "PASSIONE",
  "passion-text": "Il mio entusiasmo per la tecnologia e la programmazione mi spinge a continuare a imparare e a migliorare continuamente.",
  "professionality": "PROFESSIONALITÁ",
  "professionality-text": "Attribuisco grande importanza alla puntualità, all'affidabilità e alla qualità in tutti i miei progetti.",
  "patience": "DETERMINAZIONE",
  "patience-text": "Le sfide e i fallimenti non mi fermano. Rimango concentrato e lavoro sodo fino a raggiungere il mio obiettivo.",
  "creativity": "CREATIVITÁ",
  "creativity-text": "Trovo soluzioni innovative e porto idee fresche in ogni progetto per ottenere risultati unici ed efficaci.",
  "empathy": "EMPATIA",
  "empathy-text": "Ascolto attivamente e comprendo le esigenze dei miei colleghi e clienti per ottenere insieme i migliori risultati.",
  "i_am": "Sono",
  "available_for": "disponibile per:",
  "job": "Lavoro",
  "project": "Progetti",
  "professional_growth": "Crescita",
  "text1": "Sto cercando nuove ed entusiasmanti opportunità. Una di queste è un impiego a tempo indeterminato. Con me a bordo, potete contare su un dipendente serio e leale, sempre aperto a nuove sfide e discussioni. Questo mi rende il candidato perfetto per la vostra azienda.",
  "text2": "Hai un progetto e hai bisogno di supporto? Vuoi creare un sito web per la tua azienda? Stai cercando una persona affidabile per il tuo team? Allora sono la persona giusta per te. Grazie alla mia creatività e alle mie competenze, posso offrire professionalità e originalità.",
  "text3": "Cerco sempre di migliorarmi e imparare cose nuove! Sono sempre aperto al dialogo e accetto senza problemi le critiche costruttive. Nella vita non si smette mai di imparare, ed è proprio questo che mi motiva a lavorare continuamente sulle mie capacità e ad affrontare nuove sfide.",
  "to_contact": "Contattami >>",
  "technical_skills": "Conoscenze",
  "skills_description": "Ho acquisito le mie competenze tecniche attraverso l'autoapprendimento e l'esperienza pratica. Grazie alla formazione continua e al lavoro su progetti personali, ho sviluppato una solida comprensione di vari linguaggi di programmazione e tecnologie. Il mio obiettivo è continuare ad apprendere e sviluppare soluzioni innovative. Porto la mia creatività e le mie conoscenze tecniche per ottenere risultati di alta qualità.",
  "html": "Possiedo solide conoscenze in HTML, CSS e JavaScript, che mi permettono di creare siti web accattivanti e interattivi. Con HTML strutturo il contenuto delle mie pagine, mentre CSS si occupa dello stile e del layout. Utilizzo JavaScript per migliorare l'esperienza utente e aggiungere elementi dinamici.",
  "angular": "Con Angular sviluppo siti web potenti e responsive. Le mie competenze comprendono l'uso di TypeScript, componenti e servizi di Angular per applicazioni single-page efficienti. Ciò garantisce non solo la sicurezza dei tipi, ma anche uno sviluppo rapido e soluzioni creative per sfide complesse. Con Angular Material sono in grado di progettare e implementare componenti web moderni e intuitivi.",
  "python": "Oltre alle mie competenze nello sviluppo web, lavoro anche con Python. Sebbene sia ancora nel processo di apprendimento, sto già sviluppando competenze di base. La versatilità di questo linguaggio mi consente di crescere in diversi ambiti dello sviluppo software.",
  "java": "Sono ancora nel processo di apprendimento di Java, ma sto già facendo i miei primi passi. Anche se sono ancora un principiante, ho iniziato a sviluppare semplici programmi e a familiarizzare con le basi del linguaggio. Il mio obiettivo è continuare a migliorare le mie competenze in Java e creare applicazioni più complesse.",
  "node_js": "Con conoscenze di base nel backend, in particolare in Node.js, sono in grado di sviluppare e gestire applicazioni lato server. Le mie competenze mi permettono di implementare funzioni fondamentali come la creazione di server, l'elaborazione delle richieste e l'interazione con i database in Node.js. Mentre continuo ad apprendere e a svilupparmi, sono pronto ad ampliare ulteriormente le mie capacità nel backend e ad affrontare progetti più complessi.",
  "github": "Grazie alle mie solide conoscenze nell'uso di GitHub, dimostro un'efficace gestione delle versioni e collaborazione nei progetti. Con l'uso di branching, pull requests e issue tracking, sono in grado di garantire un processo di sviluppo strutturato ed efficiente. I miei repository su GitHub riflettono la mia capacità di produrre codice di alta qualità e di lavorare con successo in un ambiente di squadra.",
  "soft_skills": "Soft Skills",
  "communication": "Comunicazione",
  "Customer": "Approccio al cliente",
  "organisation": "Abilità di gestione",
  "flexibility": "Versatilità",
  "sales": "Abilità di vendita",
  "teamwork": "Competenze collaborative",
  "problem-solving": "Abilità di problem-solving",
  "contact-txt": "Se sei pronto a trasformare le tue idee in realtà o se hai domande, sarò felice di ricevere un tuo messaggio. Contattami tramite il modulo qui sotto e realizziamo insieme cose straordinarie.",
  "surname": "Cognome*",
  "name": "Nome*",
  "company": "Azienda (Opzionale)",
  "phone": "Telefono (Opzionale)",
  "message": "Messaggio",
  "sent": "Invia"
}
